upstream/OpenFOAM-v2606/tutorials/heatTransfer/chtMultiRegionFoam/externalSolarLoad/constant/air/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

".*"
{
    type        transparent;

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        emissivity      (1 1);
        absorptivity    (0 0);
    }
}

air_to_solid
{
    type        opaqueReflective;

    // Fraction of the reflected is diffussive
    fd          0.0; // 0: all specular 1: all diffusive

    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.1 0.1);
        emissivity      (0.1 0.1);
    };
}

air_to_floor
{
    type       opaqueDiffusive;
    wallAbsorptionEmissionModel
    {
        type            multiBandAbsorption;
        absorptivity    (0.3 0.7);
        emissivity      (0.3 0.7);
    };
}


// ************************************************************************* //
